Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The :ref:`structure-build-conf-bblayers.conf` file tells BitBake what layers you want considered during the build. By default, the layers listed in this file include layers minimally needed by the build system. However, you must manually add any custom layers you have created. You can find more information on working with the :ref:`structure-build-conf-bblayers.conf` file in the ":ref:`dev-manual/layers:enabling your layer`" section in the Yocto Project Development Tasks Manual.
it_it: Il file :ref:`structure-build-conf-bblayers.conf` indica a BitBake quali layer considerare durante la compilazione. Per default, i layer elencati in questo file includono quelli minimi necessari al sistema di compilazione. Tuttavia, è necessario aggiungere manualmente eventuali layer personalizzati creati. Ulteriori informazioni sull'utilizzo del file :ref:`structure-build-conf-bblayers.conf` sono disponibili nella sezione ":ref:`dev-manual/layers:enabling your layer`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: The :term:`BitBake` task executor together with various types of configuration files form the :term:`OpenEmbedded-Core (OE-Core)`. This section overviews these components by describing their use and how they interact.
it_it: L'esecutore di attività [task], :term:`BitBake`, insieme a vari tipi di file di configurazione, costituisce il :term:`OpenEmbedded-Core (OE-Core)`. Questa sezione offre una panoramica di questi componenti, descrivendone l'utilizzo e le interazioni.

source: The :term:`FILESEXTRAPATHS` variable in the append files extends the search path the build system uses to find files during the build. Consequently, for this example you need to have the ``files`` directory in the same location as your append file.
it_it: La variabile :term:`FILESEXTRAPATHS` nei file di append estende il path di ricerca utilizzato dal sistema di build per trovare i file durante la compilazione. Di conseguenza, per questo esempio, è necessario che la directory ``files`` si trovi nella stessa posizione del file di append.

source: The :term:`OpenEmbedded Build System` build system has a built-in mechanism allowing to save execution time by re-using pre-built artifacts: the :ref:`shared state cache (sstate cache) <overview-manual/concepts:shared state cache>`. These artifacts are stored in a directory (:term:`SSTATE_DIR`) and are not signed by default.
it_it: Il sistema di build :term:`OpenEmbedded Build System` dispone di un meccanismo integrato che consente di risparmiare tempo di esecuzione riutilizzando artefatti precompilati: la :ref:`cache dello shared state (sstate cache) <overview-manual/concepts:shared state cache>`. Questi artefatti sono memorizzati in una directory (:term:`SSTATE_DIR`) e non sono firmati per default.

source: The :term:`OpenEmbedded Build System` can create the :ref:`structure-build-conf-local.conf` file from a ``local.conf.sample`` file when you ``source`` the top-level build environment setup script :ref:`structure-core-script`.
it_it: Il :term:`OpenEmbedded Build System` può creare il file :ref:`structure-build-conf-local.conf` da un file ``local.conf.sample`` quando si esegue il comando ``source`` dello script di configurazione dell'ambiente di compilazione di livello superiore :ref:`structure-core-script`.

source: The :term:`OpenEmbedded Build System` is used to run the builds and careful consideration has gone into how it does this with the aim of being both secure and reproducible. Like any system, it does need to be used carefully and in keeping with the design for that to be true. Users of the system should consider that:
it_it: :term:`OpenEmbedded Build System` viene utilizzato per eseguire le compilazioni e la sua progettazione è stata attentamente studiata per garantire sicurezza e riproducibilità. Come qualsiasi sistema, è necessario utilizzarlo con attenzione e in conformità con la sua progettazione affinché ciò sia possibile. Gli utenti del sistema devono tenere presente quanto segue:

source: The :term:`OpenEmbedded Build System` uses a "workflow" to accomplish image and SDK generation. The following figure overviews that workflow:
it_it: :term:`OpenEmbedded Build System` usa un "workflow" per la generazione di immagini e SDK. La figura seguente illustra tale flusso di lavoro:

source: The :term:`OpenEmbedded-Core (OE-Core)` repository is hosted at :oe_git:`/openembedded-core`.
it_it: Il repository di :term:`OpenEmbedded-Core (OE-Core)` è ospitato su :oe_git:`/openembedded-core`.

source: The :term:`PR` variable is used to indicate different revisions of a recipe that reference the same upstream source version. It can be used to force a new version of a recipe to be installed onto a device from a package feed. These once had to be set manually but in most cases these can now be set and incremented automatically by a PR Server connected with a package feed.
it_it: La variabile :term:`PR` viene utilizzata per indicare le diverse revisioni di una ricetta che fanno riferimento alla stessa versione del sorgente upstream. Può essere utilizzata per forzare l'installazione di una nuova versione di una ricetta su un dispositivo da un feed di pacchetti. In passato, queste variabili dovevano essere impostate manualmente, ma nella maggior parte dei casi ora possono essere impostate e incrementate automaticamente da un PR Server connesso a un feed di pacchetti.

source: The :term:`SDKMACHINE` variable determines whether you build tools for a 32-bit or 64-bit system.
it_it: La variabile :term:`SDKMACHINE` determina se si compilano gli strumenti per un sistema a 32 bit o a 64 bit.

source: The :term:`SPDX` file is under ``tmp/deploy/spdx/<spdx_version>/<MACHINE>/recipes/recipe-linux-yocto.spdx.json``
it_it: Il file :term:`SPDX` si trova in ``tmp/deploy/spdx/<spdx_version>/<MACHINE>/recipes/recipe-linux-yocto.spdx.json``

source: The :term:`Source Directory` consists of numerous files, directories and subdirectories; understanding their locations and contents is key to using the Yocto Project effectively. This chapter describes the Source Directory and gives information about those files and directories.
it_it: La :term:`Source Directory` [Directory Sorgente] è composta da numerosi file, directory e sottodirectory; comprenderne la posizione e il contenuto è fondamentale per utilizzare efficacemente il Yocto Project. Questo capitolo descrive la Source Directory e fornisce informazioni su file e directory.

source: The :term:`Source Directory` contains :term:`BitBake`, :term:`OpenEmbedded-Core (OE-Core)`, and other files that all support the Yocto Project.
it_it: La directory :term:`Source Directory` contiene :term:`BitBake`, :term:`OpenEmbedded-Core (OE-Core)` e altri file che supportano Yocto Project.

source: The :term:`Source Directory` contains both general layers and BSP layers right out of the box. You can easily identify layers that ship with a Yocto Project release in the Source Directory by their names. Layers typically have names that begin with the string ``meta-``.
it_it: :term:`Source Directory` contiene sia layer generali che layer BSP già pronti all'uso. È possibile identificare facilmente i layer inclusi in una release di Yocto Project nella directory dei sorgenti tramite i loro nomi. I layer hanno in genere nomi che iniziano con la stringa ``meta-``.

source: The :term:`bitbake:BitBake Build` directory, named ``build``. Later, when the build completes, this directory contains all the files created during the build.
it_it: La directory :term:`bitbake:BitBake Build`, chiamata ``build``. Successivamente, al termine della compilazione, questa directory conterrà tutti i file creati durante il processo.

source: The :term:`configuration files <Configuration File>` (``.conf``) define various configuration variables that govern the OpenEmbedded build process. These files fall into several areas that define machine configuration options, distribution configuration options, compiler tuning options, general common configuration options, and user configuration options in :ref:`structure-build-conf-local.conf`, which is found in the :term:`Build Directory`.
it_it: I :term:`file di configurazione <Configuration File>` (``.conf``) definiscono diverse variabili di configurazione che regolano il processo di build di OpenEmbedded. Questi file rientrano in diverse aree che definiscono opzioni di configurazione della macchina, opzioni di configurazione della distribuzione, opzioni di ottimizzazione del compilatore, opzioni di configurazione comuni generali e opzioni di configurazione utente in :ref:`structure-build-conf-local.conf`, che si trova nella :term:`Build Directory`.

source: The :term:`layers <Layer>` needed to build the Poky reference distribution, in the ``layers`` directory.
it_it: I :term:`layer <Layer>`, nella directory ``layers`` servono per la build della distribuzione di riferimento di Poky.

source: The :yocto_home:`Releases </development/releases/>` page contains a list of all releases of the Yocto Project, grouped into current and previous releases. Previous releases are no longer actively maintained with security patches, but well-tested patches may still be accepted for them for significant issues.
it_it: La pagina :yocto_home:`Releases </development/releases/>` contiene un elenco di tutti i rilasci di Yocto Project, suddivisi in rilasci correnti e precedenti. I rilasci precedenti non sono più attivamente mantenuti con patch di sicurezza, ma le patch ben testate possono ancora essere accettate per la risoluzione di problemi significativi.

source: The :yocto_wiki:`SWAT </Yocto_Build_Failure_Swat_Team>` team would not handle any test builds on the Autobuilder.
it_it: Il team :yocto_wiki:`SWAT </Yocto_Build_Failure_Swat_Team>` non gestirà alcuna build di test sull'Autobuilder.

source: The AlmaLinux 9, CentOS 9 and RockyLinux 9 distributions are affected by a bug described in :yocto_bugs:`/show_bug.cgi?id=16143`, which is the reason why a :term:`buildtools` tarball is required.
it_it: Le distribuzioni AlmaLinux 9, CentOS 9 e RockyLinux 9 sono interessate da un bug descritto in :yocto_bugs:`/show_bug.cgi?id=16143`, motivo per cui è necessario un file tarball :term:`buildtools`.

source: The Autobuilder workers are non-homogeneous, which means regular testing across a variety of Linux distributions occurs. The Autobuilder is limited to only testing QEMU-based setups and not real hardware.
it_it: I worker di Autobuilder non sono omogenei, il che significa che vengono eseguiti regolarmente test su una varietà di distribuzioni Linux. Autobuilder è limitato al test di configurazioni basate su QEMU e non di hardware reale.

source: The BSP layer's base directory (``meta-bsp_root_name``) is the root directory of that Layer. This directory is what you add to the :term:`BBLAYERS` variable in the :ref:`structure-build-conf-bblayers.conf` file found in your :term:`Build Directory`, which is established after you run the OpenEmbedded build environment setup script (i.e. :ref:`structure-core-script`). Adding the root directory allows the :term:`OpenEmbedded Build System` to recognize the BSP layer and from it build an image. Here is an example::
it_it: La directory base del layer BSP (``meta-bsp_root_name``) è la directory radice di quel layer. Questa directory è quella che si aggiunge alla variabile :term:`BBLAYERS` nel file :ref:`structure-build-conf-bblayers.conf` che si trova nella :term:`Build Directory`, che viene creata dopo aver eseguito lo script di configurazione dell'ambiente di build di OpenEmbedded (ovvero :ref:`structure-core-script`). L'aggiunta della directory radice consente a :term:`OpenEmbedded Build System` di riconoscere il layer BSP e da esso di creare un'immagine. Ecco un esempio::

source: The BSP specification does not include a build system or other tools - the specification is concerned with the hardware-specific components only. At the end-distribution point, you can ship the BSP layer combined with a build system and other tools. Realize that it is important to maintain the distinction that the BSP layer, a build system, and tools are separate components that could be combined in certain end products.
it_it: La specifica BSP non include un sistema di build o altri strumenti: essa riguarda esclusivamente i componenti specifici dell'hardware. Al punto di distribuzione finale, è possibile distribuire il layer BSP combinato con un sistema di build e altri strumenti. È importante mantenere la distinzione tra layer BSP, sistema di build e tool come componenti separati che possono essere combinati in determinati prodotti finali.

source: The BeagleBone development board requires an SPL to boot and that SPL file type must be MLO. Consequently, the machine configuration needs to define :term:`SPL_BINARY` as ``MLO``.
it_it: La scheda di sviluppo BeagleBone richiede un SPL per l'avvio e il tipo di file SPL deve essere MLO. Di conseguenza, la configurazione della macchina deve definire :term:`SPL_BINARY` come ``MLO``.

source: The BitBake documentation can be found :doc:`here <bitbake:index>`.
it_it: La documentazione di BitBake è disponibile :doc:`qui <bitbake:index>`.

source: The Build Appliance is a virtual machine image that enables you to build and boot a custom embedded Linux image with the Yocto Project using a non-Linux development system.
it_it: La Build Appliance è un'immagine di macchina virtuale che consente di creare e avviare un'immagine Linux embedded personalizzata con Yocto Project utilizzando un sistema di sviluppo non Linux.

source: The Build Directory
it_it: La Build Directory

source: The Build Directory --- ``build/``
it_it: La Directory di Build --- ``build/``

source: The CVE database contains some old incomplete entries which have been deemed not to impact :term:`OpenEmbedded-Core (OE-Core)`. These CVE entries can be excluded from the check by adding the following statement::
it_it: Il database CVE contiene alcune voci obsolete e incomplete che sono state ritenute non rilevanti per :term:`OpenEmbedded-Core (OE-Core)`. È possibile escludere queste voci CVE dal controllo aggiungendo la seguente istruzione::

source: The Development Host
it_it: Host di Sviluppo

source: The Directory for Cloning Layers
it_it: La Directory per la Clonazione dei Layer

source: The Django fixture feature overrides the default layer server when you use it to specify a custom URL. To use the fixture feature, create (or edit) the file ``bitbake/lib/toaster.orm/fixtures/custom.xml``, and then set the following Toaster setting to your custom URL:
it_it: La funzionalità Fixture di Django sovrascrive il server di layer di default quando la si utilizza per specificare un URL personalizzato. Per utilizzare la funzionalità Fixture, creare (o modificare) il file ``bitbake/lib/toaster.orm/fixtures/custom.xml`` e impostare la seguente configurazione di Toaster col proprio URL personalizzato:

source: The JSON data for this query is returned in a single line. In the previous example the line has been artificially split for readability.
it_it: I dati JSON per questa query vengono restituiti su una singola riga. Nell'esempio precedente, la riga è stata suddivisa artificialmente per una migliore leggibilità.

source: The OpenEmbedded Build System Workflow
it_it: Workflow del Sistema di Build OpenEmbedded

source: The OpenEmbedded Build System can generate such documentation for your project, in :term:`SPDX` format, based on all the metadata it used to build the software images. See the ":ref:`dev-manual/sbom:creating a software bill of materials`" section of the Development Tasks manual.
it_it: Il sistema di build OpenEmbedded può generare tale documentazione per il progetto, in formato :term:`SPDX`, basandosi su tutti i metadati utilizzati per creare le immagini software. Consultare la sezione ":ref:`dev-manual/sbom:creating a software bill of materials`" del Manuale di Sviluppo dei Task.

source: The OpenEmbedded build system automatically adds common types of runtime dependencies between packages, which means that you do not need to explicitly declare the packages using :term:`RDEPENDS`. There are three automatic mechanisms (``shlibdeps``, ``pcdeps``, and ``depchains``) that handle shared libraries, package configuration (pkg-config) modules, and ``-dev`` and ``-dbg`` packages, respectively. For other types of runtime dependencies, you must manually declare the dependencies.
it_it: Il sistema di build OpenEmbedded aggiunge automaticamente i tipi più comuni di dipendenze di runtime tra i pacchetti, il che significa che non è necessario dichiarare esplicitamente i pacchetti utilizzando :term:`RDEPENDS`. Esistono tre meccanismi automatici (``shlibdeps``, ``pcdeps`` e ``depchains``) che gestiscono rispettivamente le librerie shared, i moduli di configurazione dei pacchetti (pkg-config) e i pacchetti ``-dev`` e ``-dbg``. Per altri tipi di dipendenze di runtime, è necessario dichiararle manualmente.

source: The OpenEmbedded build system can create it from a ``bblayers.conf.sample`` file when you ``source`` the top-level build environment setup script (i.e. :ref:`structure-core-script`).
it_it: Il sistema di build OpenEmbedded può crearlo a partire da un file ``bblayers.conf.sample`` quando si esegue il comando ``source`` sullo script di configurazione dell'ambiente di compilazione di livello superiore (ovvero :ref:`structure-core-script`).

source: The OpenEmbedded build system creates and uses this directory for all the build system's output. The :term:`TMPDIR` variable points to this directory.
it_it: Il sistema di build OpenEmbedded crea e utilizza questa directory per tutti gli output del sistema di build. La variabile :term:`TMPDIR` punta a questa directory.

source: The OpenEmbedded build system creates the :term:`Build Directory` when you run the build environment setup script :ref:`structure-core-script`. If you do not give the :term:`Build Directory` a specific name when you run the setup script, the name defaults to ``build/``.
it_it: Il sistema di build OpenEmbedded crea la :term:`Build Directory` quando si esegue lo script di configurazione dell'ambiente di build :ref:`structure-core-script`. Se non si specifica un nome per la :term:`Build Directory` durante l'esecuzione dello script di configurazione, il nome predefinito è ``build/``.

source: The OpenEmbedded build system creates this directory to hold toolchain installer scripts which, when executed, install the sysroot that matches your target hardware. You can find out more about these installers in the ":ref:`sdk-manual/appendix-obtain:building an sdk installer`" section in the Yocto Project Application Development and the Extensible Software Development Kit (eSDK) manual.
it_it: Il sistema di build OpenEmbedded crea questa directory per contenere gli script di installazione della toolchain che, una volta eseguiti, installano il sysroot corrispondente all'hardware target. Ulteriori informazioni su questi programmi di installazione sono disponibili nella sezione ":ref:`sdk-manual/appendix-obtain:building an sdk installer`" del Manuale di Sviluppo di Applicazioni Yocto Project e Software Development Kit (eSDK).

source: The OpenEmbedded build system creates this directory when you enable build history via the :ref:`ref-classes-buildhistory` class file. The directory organizes build information into image, packages, and SDK subdirectories. For information on the build history feature, see the ":ref:`dev-manual/build-quality:maintaining build output quality with \`\`buildhistory\`\``" section in the Yocto Project Development Tasks Manual.
it_it: Il sistema di build OpenEmbedded crea questa directory quando si abilita la cronologia delle compilazioni tramite il file di classe :ref:`ref-classes-buildhistory`. La directory organizza le informazioni di compilazione in sottodirectory per immagini, pacchetti e SDK. Per informazioni sulla funzionalità di cronologia delle build, consultare la sezione ":ref:`dev-manual/build-quality:maintaining build output quality with \`\`buildhistory\`\``" nel Manuale di Sviluppo dei Task di Yocto Project.

source: The OpenEmbedded build system does not support file or directory names that contain spaces. Be sure that the Source Directory you use does not contain these types of names.
it_it: Il sistema di build OpenEmbedded non supporta nomi di file o directory contenenti spazi. Assicurarsi che la directory sorgente utilizzata non contenga questo tipo di nomi.

source: The OpenEmbedded build system does not support file or directory names that contain spaces. If you attempt to run the ``oe-init-build-env`` script from a :term:`Source Directory` that contains spaces in either the filenames or directory names, the script returns an error indicating no such file or directory. Be sure to use a :term:`Source Directory` free of names containing spaces.
it_it: Il sistema di build OpenEmbedded non supporta nomi di file o directory contenenti spazi. Se si tenta di eseguire lo script ``oe-init-build-env`` da una :term:`Source Directory` che contiene spazi nei nomi di file o directory, lo script restituisce un errore indicando che il file o la directory non esiste. Assicurarsi di utilizzare una :term:`Source Directory` priva di nomi contenenti spazi.

source: The OpenEmbedded build system searches this directory for configuration files that correspond to the value of :term:`SDKMACHINE`. By default, 32-bit and 64-bit x86 files ship with the Yocto Project that support some SDK hosts. However, it is possible to extend that support to other SDK hosts by adding additional configuration files in this subdirectory within another layer.
it_it: Il sistema di build OpenEmbedded cerca in questa directory i file di configurazione corrispondenti al valore di :term:`SDKMACHINE`. Per default, Yocto Project include file x86 a 32 e 64 bit che supportano alcuni host SDK. Tuttavia, è possibile estendere tale supporto ad altri host SDK aggiungendo ulteriori file di configurazione in questa sottodirectory all'interno di un altro layer.

source: The OpenEmbedded build system uses :term:`BitBake` to produce images and Software Development Kits (SDKs). You can see from the :ref:`general workflow figure <overview-manual/concepts:openembedded build system concepts>`, the BitBake area consists of several functional areas. This section takes a closer look at each of those areas.
it_it: Il sistema di build di OpenEmbedded utilizza :term:`BitBake` per produrre immagini e Software Development Kit (SDK). Come si può vedere nella :ref:`figura del flusso di lavoro generale <overview-manual/concepts:openembedded build system concepts>`, l'area BitBake è composta da diverse aree funzionali. Questa sezione esamina più nel dettaglio ciascuna di queste aree.

source: The OpenEmbedded build system uses BitBake to generate the Software Development Kit (SDK) installer scripts for both the standard SDK and the extensible SDK (eSDK):
it_it: Il sistema di build OpenEmbedded utilizza BitBake per generare gli script di installazione del Software Development Kit (SDK) sia per l'SDK standard che per l'SDK estensibile (eSDK):
